<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of WacomTablet</string>
    <key>Identifier</key>
    <string>com.github.yourejuanito.download.WacomTablet</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>WacomTablet</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://cdn.wacom.com/u/productsupport/drivers/mac/professional/</string>
                <key>re_pattern</key>
                <string>https://cdn\.wacom\.org/u/productsupport/drivers/mac/profesional/WacomTablet-[0-9\.-]*-/[0-9\.]*.dmg</string>
                <key>comment</key>
                <string>Example: https://cdn.wacom.com/u/productsupport/drivers/mac/professional/WacomTablet_6.3.42-1.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
          <key>Processor</key>
          <string>CodeSignatureVerifier</string>
          <key>Arguments</key>
          <dict>
            <key>input_path</key>
            <string>%pathname%/%NAME%.pkg</string>
            <key>expected_authority_names</key>
            <array>
              <string>Developer ID Installer: Wacom Technology Corp. (EG27766DY7)</string>
              <string>Developer ID Certification Authority</string>
              <string>Apple Root CA</string>
            </array>
          </dict>
        </dict>
    </array>
</dict>
</plist>
